In [1]:
import pandas as pd

In [2]:
dic={
    'name':['hima','bhima','sima','dima'],
    'science':[24,25,26,28],
    'science':[30,27,23,24],
}

In [3]:
dic

{'name': ['hima', 'bhima', 'sima', 'dima'], 'science': [30, 27, 23, 24]}

In [4]:
dic1=pd.DataFrame(dic,index=[1,2,3,4])

In [5]:
dic1

    name  science
1   hima       30
2  bhima       27
3   sima       23
4   dima       24

In [6]:
dic1['english']=[15,26,17,20]

In [7]:
dic1

    name  science  english
1   hima       30       15
2  bhima       27       26
3   sima       23       17
4   dima       24       20

In [8]:
type(dic1)

pandas.core.frame.DataFrame

In [10]:
dic1.transpose()

            1      2     3     4
name     hima  bhima  sima  dima
science    30     27    23    24
english    15     26    17    20